
import Part_1.Create_threads.Variant_1;
import Part_1.Create_threads.Variant_2;
import Part_1.Stoping_threads.Variant_01;
import Part_1.Stoping_threads.Variant_02;
import Part_1.Stoping_threads.Variant_03;

public class Main {
    public static void main(String[] args) throws InterruptedException {


//===============================================================================================

        // Вариант 1 создания потока посредство наследования методов класса Thread

//        Variant_1 vr1 = new Variant_1();
//        vr1.start(); // start позволяет лишь единожды запустить один и тот же поток,
        // и после того как поток закончит свою жизнь больше его не запускать.
        // Для тестов можно использовать run, что бы было проще,
        // так как он позволяет запускать поток снова и снова нужно е количество раз

//===============================================================================================

        // Вариант 2 создания потока посредством реализации интерфейса Runnable,
        // но здесь будет отсутсвовать метод start

//        Variant_2 vr2 = new Variant_2();
//        vr2.run();

//===============================================================================================

        // Вариант 1 прерывания потока (вернее усыпление на заданное время)

//        Variant_01 v1 = new Variant_01();
//        v1.start();

//===============================================================================================
        // Вариант 2 прерывания потока
//        Variant_02 v2 = new Variant_02();
//
//        System.out.println("поток стартовал");
//        v2.start();
//        try {
//            Thread.sleep(50);
//
//            v2.interrupt();
//
//            Thread.sleep(50);  // не понял механику: если sleep установить значение "5", то выполнение потока будет выполнено после финиширования потока (согласно выводу в терминал)
//        } catch (InterruptedException e){
//            System.out.println("interrupted");
//        }
//        System.out.println("поток финишировал");

//===============================================================================================

        // Вариант 3 прерывания потока посредством команды break

//        System.out.println("Начало потока");
//        Variant_03 v3 = new Variant_03();
//        v3.start();

//===============================================================================================


    }
}